Tekla.Structures.Model.BendSurfaceNode
The BendSurfaceNode class represents a bend surface geometry tree node.

Tekla.Structures.Model.BendSurfaceNode.#ctor(Tekla.Structures.Model.BendSurface)
Initializes a new instance of the BendSurfaceNode class.
surface: The contour of the node.

Tekla.Structures.Model.BendSurfaceNode.IsAutomatic
Gets a value indicating whether this geometry node was automatically generated (returns false if it was originally a user-defined part)

Tekla.Structures.Model.BendSurfaceNode.Surface
Gets the bend surface geometry.

Tekla.Structures.Model.BendSurfaceNode.AcceptVisitor(Tekla.Structures.Model.IGeometryNodeVisitor)
Entry method for the visitor pattern
visitor:

Tekla.Structures.Model.BendSurfaceNode.Clone
Creates a new object that is a copy of the current instance.
Returns: A new object that is a copy of the current instance.